using NoteApp;
using NUnit.Framework;
using System;
using System.Diagnostics.Contracts;
using System.Runtime.Remoting.Contexts;

namespace NoteApp.UnitTests
{
    /// <summary>
    /// Класс Unit тестов класса <see cref="Note"/>.
    /// </summary>
    [TestFixture]
    public class NoteTests
    {
        /// <summary>
        /// Поле заметка для тестирования.
        /// </summary>
        private Note _note;

        /// <summary>
        /// Метод создания объекта класса перед запуском каждого тестирования.
        /// </summary>
        [SetUp]
        public void InitNote()
        {
            _note = new Note();
        }

        /// <summary>
        /// Позитивный тест геттера Name.
        /// </summary>
        [Test(Description = "Позитивный тест геттера Name.")]
        public void TestNameGetCurrentValue()
        {
            var expected = "Азбука";
            _note.Name = expected;
            var actual = _note.Name;
            Assert.AreEqual(expected, actual);
        }

        /// <summary>
        /// Позитивный тест сеттера Name
        /// </summary>
        [Test(Description = "Присвоение названия")]
        public void TestnNameSetCurrentValue()
        {
            var name = "Азбука";
            var note = new Note();
            Assert.Throws<ArgumentException>(
            () => { note.Name = name; },
            "Если всё правильно, не должно возникать исключения");
        }

        /// <summary>
        /// TestCase методов проверки сеттера свойства Name.
        /// </summary>
        /// <param name="wrongName">Неверное поле названия.</param>
        /// <param name="message">Текст ошибки.</param>
        [TestCase("", "Должно возникать исключение, если имя - пустая строка",
            TestName = "Присвоение пустой строки в качестве названия")]
        [TestCase("АзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбука",
            "Должно возникать исключение, если название длиннее 50 символов",
            TestName = "Присвоение неправильного названия больше 50 символов")]
        public void TestNameSetArgumentException(string wrongName, string message)
        {
            Assert.Throws<ArgumentException>(
            () => { _note.Name = wrongName; },
            message);
        }

        /// <summary>
        /// Позитивный тест геттера Category.
        /// </summary>
        [Test(Description = "Позитивный тест геттера Category.")]
        public void TestCategoryGetCurrentValue()
        {
            var expected = NoteCategories.Документы;
            _note.Category = expected;
            var actual = _note.Category;
            Assert.AreEqual(expected, actual);
        }

        /// <summary>
        /// Позитивный тест сеттера Category
        /// </summary>
        [Test(Description = "Присвоение категории")]
        public void TestCategorySetCurrentValue()
        {
            var category = NoteCategories.Документы;
            var note = new Note();
            Assert.Throws<ArgumentException>(
            () => { note.Category = category; },
            "Если всё правильно, не должно возникать исключения");
        }

        /// <summary>
        /// Позитивный тест геттера Text.
        /// </summary>
        [Test(Description = "Позитивный тест геттера Text.")]
        public void TestTextGetCurrentValue()
        {
            var expected = "Азбука";
            _note.Text = expected;
            var actual = _note.Text;
            Assert.AreEqual(expected, actual);
        }

        /// <summary>
        /// TestCase методов проверки сеттера свойства Text.
        /// </summary>
        /// <param name="wrongText">Неверное поле текст.</param>
        /// <param name="message">Текст ошибки.</param>
        [TestCase("", "Должно возникать исключение, если текст - пустая строка",
            TestName = "Присвоение пустой строки в качестве текста")]
        [TestCase("АзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбукаАзбука",
            "Должно возникать исключение, если текст длиннее 20000 символов",
            TestName = "Присвоение неправильного текста больше 20000 символов")]
        public void TestTextSetArgumentException(string wrongText, string message)
        {
            Assert.Throws<ArgumentException>(
            () => { _note.Text = wrongText; },
            message);
        }

        /// <summary>
        /// Позитивный тест геттера Created.
        /// </summary>
        [Test(Description = "Позитивный тест геттера Created.")]
        public void TestCreatedGetCurrentValue()
        {
            var expected = DateTime.Now;
            _note.Created = expected;
            var actual = _note.Created;
            Assert.AreEqual(expected, actual);
        }

        /// <summary>
        /// Позитивный тест сеттера Created
        /// </summary>
        [Test(Description = "Присвоение времени создания")]
        public void TestCreatedSetCurrentValue()
        {
            var created = DateTime.Now;
            var note = new Note();
            Assert.Throws<ArgumentException>(
            () => { note.Created = created; },
            "Если всё правильно, не должно возникать исключения");
        }

        /// <summary>
        /// Присвоение времени создания больше чем сейчас
        /// </summary>
        [Test(Description = "Присвоение времени создания больше чем сейчас")]
        public void TestCreatedSet_OverTime()
        {
            var created = new DateTime(2045,5,5);
            var note = new Note();
            Assert.Throws<ArgumentException>(
            () => { note.Created = created; },
            "Должно возникать исключение если время больше чем сейчас");
        }

        /// <summary>
        /// Позитивный тест геттера LastUpdated.
        /// </summary>
        [Test(Description = "Позитивный тест геттера LastUpdated.")]
        public void TestLastUpdatedGetCurrentValue()
        {
            var expected = DateTime.Now;
            _note.LastUpdated = expected;
            var actual = _note.LastUpdated;
            Assert.AreEqual(expected, actual);
        }

        /// <summary>
        /// Позитивный тест сеттера LastUpdated
        /// </summary>
        [Test(Description = "Присвоение времени последнего обновления")]
        public void TestLastUpdatedSetCurrentValue()
        {
            var lastUpdated = DateTime.Now;
            var note = new Note();
            Assert.Throws<ArgumentException>(
            () => { note.LastUpdated = lastUpdated; },
            "Если всё правильно, не должно возникать исключения");
        }

        /// <summary>
        /// TestCase методов проверки сеттера свойства LastUpdated.
        /// </summary>
        /// <param name="wrongLastUpdated">Неверное поле последнего обновления.</param>
        /// <param name="message">Текст ошибки.</param>
        [TestCase("DateTime(2045,5,5)", "Должно возникать исключение, если время последнего обновления - больше текущего",
            TestName = "Присвоение неправильного времени больше текущего в качестве времени последнего обновления")]
        [TestCase("DateTime(2024,5,11)",
            "Должно возникать исключение, если время последнего обновления больше чем время создания",
            TestName = "Присвоение неправильного времени последнего обновления больше чем время создания")]
        public void TestLastUpdatedSetArgumentException(DateTime wrongLastUpdated, string message)
        {
            Assert.Throws<ArgumentException>(
            () => { _note.LastUpdated = wrongLastUpdated; },
            message);
        }

        /// <summary>
        /// Тест конструктора c параметрами.
        /// </summary>
        [Test(Description = "Тестирование констуктора с параметрами.")]
        public void TestСonstructorWithParameters()
        {
            Assert.DoesNotThrow(() => new Note(
                "Название",
                NoteCategories.Документы,
                "пзавзпвазпхыпхаыхпзавзпхыахпыа",
                new DateTime(2000, 1, 1),
                new DateTime(2000, 1, 1)
                ));
        }

        /// <summary>
        /// Тест конструктора без параметров.
        /// </summary>
        [Test(Description = "Тестирование констуктора без параметров.")]
        public void TestСonstructorWithoutParameters()
        {
            Assert.DoesNotThrow(() => new Note());
        }

        /// <summary>
        /// Тест конструктора с частичными параметрами.
        /// </summary>
        [Test(Description = "Тестирование констуктора с частичными параметрами.")]
        public void TestСonstructorWithSameParameters()
        {
            Assert.DoesNotThrow(() => new Note(
                "Название",
                NoteCategories.Документы,
                "пзавзпвазпхыпхаыхпзавзпхыахпыа"
                ));
        }

        /// <summary>
        /// Тестирвание метода клонирования заметки.
        /// </summary>
        [Test(Description = "Тестирование метода клонирования заметки.")]
        public void TestCloneNote()
        {
            _note = new Note(
                "Название",
                NoteCategories.Документы,
                "пзавзпвазпхыпхаыхпзавзпхыахпыа",
                new DateTime(2000, 1, 1),
                new DateTime(2000, 1, 1)
                );
            var clone = (Note)_note.Clone();
            var result = (
                clone.Name == _note.Name &&
                clone.Text == _note.Text &&
                clone.Category == _note.Category &&
                clone.Created == _note.Created &&
                clone.LastUpdated == _note.LastUpdated);
            Assert.IsTrue(result);
        }

        /// <summary>
        /// Тестирование метода обновления заметки.
        /// </summary>
        [Test(Description = "Позитивный тест метода Updated.")]
        public void TestUpdated()
        {
            var name = "Азбука";
            var actual = DateTime.Now;
            var lastUpdated = DateTime.Now;
            actual = _note.LastUpdated;
            Assert.AreEqual(lastUpdated, actual);
        }
    }
}